           77 CLIENTS-FILE-STATUS  PIC 99.
           77 WRK-TITLE            PIC X(16) VALUE "BASIC COBOL CRUD".
           77 WRK-CURRENT-SCR      PIC X(8) VALUE SPACES.
           77 WRK-MSG              PIC X(32) VALUE SPACES.
           77 WRK-OPTION           PIC X(1).
           77 WRK-CURSOR           PIC X(1).
           77 WRK-RECORDS-COUNT    PIC 9(6) VALUE ZEROES.
